#+Title: Test-Recipe for Bugpile/iOrg Prototpe 

*** search tasklist (rudimentary functionality)
1. evaluate

#+begin_src emacs-lisp
(setq org-columns-default-format
 "%40ITEM(Task) %TODO %object-foo %html-edit %TAGS")
#+end_src

#+results:
: %40ITEM(Task) %TODO %object-foo %html-edit %TAGS

2. delete the ID in /bugpile/objects/iorg-dblock-collect.org and
create a new one on you machine with org-id-get-create

3. use this new ID in the header of the dynamic block in file
bugpile-view-take-action-on-selected-tasks.org in the /bugpile/view/
directory.
4. update the dblock with org-dblock-update
5. open http://localhost:8008 in a browser again and follow first the
   'search tasklist' and then 'result list' links.
